bash-completion
git
git-lfs
lcov
less
man
shellcheck
strace
sudo
vim

# AutowareArchitectureProposal dependencies
python3-colcon-common-extensions
libfmt-dev
libgeographic-dev
libopencv-dev
libpcap0.8-dev
libpcl-apps1.8
libpcl-common1.8
libpcl-dev
libpcl-features1.8
libpcl-filters1.8
libpcl-io1.8
libpcl-kdtree1.8
libpcl-keypoints1.8
libpcl-ml1.8
libpcl-octree1.8
libpcl-outofcore1.8
libpcl-people1.8
libpcl-recognition1.8
libpcl-registration1.8
libpcl-sample-consensus1.8
libpcl-search1.8
libpcl-segmentation1.8
libpcl-stereo1.8
libpcl-surface1.8
libpcl-tracking1.8
libpcl-visualization1.8
libpugixml-dev
libqt5core5a
libqt5gui5
libqt5widgets5
libyaml-cpp-dev
qtbase5-dev
ros-melodic-angles
ros-melodic-automotive-navigation-msgs
ros-melodic-automotive-platform-msgs
ros-melodic-can-msgs
ros-melodic-cv-bridge
ros-melodic-diagnostic-aggregator
ros-melodic-diagnostic-updater
ros-melodic-grid-map-ros
ros-melodic-image-transport
ros-melodic-lanelet2-core
ros-melodic-lanelet2-io
ros-melodic-lanelet2-maps
ros-melodic-lanelet2-projection
ros-melodic-lanelet2-routing
ros-melodic-lanelet2-traffic-rules
ros-melodic-lanelet2-validation
ros-melodic-pacmod-msgs
ros-melodic-pcl-conversions
ros-melodic-pcl-ros
ros-melodic-roslint
ros-melodic-rviz
ros-melodic-tf
ros-melodic-tf2
ros-melodic-tf2-eigen
ros-melodic-tf2-geometry-msgs
ros-melodic-tf2-ros
ros-melodic-tf2-sensor-msgs
ros-melodic-unique-id
ros-melodic-uuid-msgs
ros-melodic-velodyne-description
